This example shows basic Query Clauses. here are several clauses (components) that make up the SELECT statement. 
Only one is mandatory - SELECT 
but of course you will usually use a few to access information you wanted

Query clauses:

SELECT          - which column to include

FROM              - which table and how the tables should be joined

WHERE           - filters unwanted data

GROUP BY     - group rows together by common column values

HAVING           - filters unwanted groups

ORDER BY      - sorts

In [1]:
import mysql.connector

In [2]:
cnx = mysql.connector.connect(user='@#$%^##', password='@#$%$^##$')
cursor = cnx.cursor()

In [3]:
sql0 = 'DROP DATABASE IF EXISTS mydata'

In [4]:
sql1 = 'CREATE DATABASE IF NOT EXISTS mydata'

In [5]:
sql2 = 'USE mydata'

In [6]:
sql3 = "CREATE TABLE IF NOT EXISTS person (Name CHAR(22), LastName VARCHAR(22))"

In [7]:
cursor.execute ("SELECT VERSION()")
row = cursor.fetchone ()
print("server version:", row[0])

server version: 8.0.11

In [8]:
cursor.execute ( sql0 )

In [9]:
cursor.execute ( sql1 )

In [10]:
cursor.execute ( sql2 )

In [11]:
cursor.execute ( sql3 )

In [12]:
name = ['Tom', 'John', 'Dave', 'Spencer', 'Bob', 'Bill', 'Frank', 'Tom', 'Thomas', 'Mike', 'Michael']
last_name = ['Powell', 'Loves', 'Obi', 'Lemmy', 'Stone', 'Rommer', 'Korg', 'Abbah', 'Linton', 'Semid', 'Vard']

In [13]:
add_person = (
  "INSERT INTO person (Name, LastName) "
  "VALUES (%s, %s)"
)

In [14]:
data = []
i = 0
for element in name:
    data.append([name[i], last_name[i]])
    i += 1
print(data)

[['Tom', 'Powell'], ['John', 'Loves'], ['Dave', 'Obi'], ['Spencer', 'Lemmy'], ['Bob', 'Stone'], ['Bill', 'Rommer'], ['Frank', 'Korg'], ['Tom', 'Abbah'], ['Thomas', 'Linton'], ['Mike', 'Semid'], ['Michael', 'Vard']]

In [15]:
for element in data:
    cursor.execute(add_person, element)

In [16]:
sql4 = "SELECT * from person"

In [17]:
cursor.execute ( sql4 )

In [18]:
for el in cursor:
    print(el)

('Tom', 'Powell')
('John', 'Loves')
('Dave', 'Obi')
('Spencer', 'Lemmy')
('Bob', 'Stone')
('Bill', 'Rommer')
('Frank', 'Korg')
('Tom', 'Abbah')
('Thomas', 'Linton')
('Mike', 'Semid')
('Michael', 'Vard')

In [19]:
# Make sure data is committed to the database
cnx.commit()

In [20]:
cursor.execute ( "DESC person" )

In [21]:
for el in cursor:
    print(el)

('Name', b'char(22)', 'YES', b'', None, b'')
('LastName', b'varchar(22)', 'YES', b'', None, b'')

In [22]:
sql5 = "SELECT Name from person"

In [23]:
cursor.execute ( sql5 )

In [24]:
for el in cursor:
    print(el)

('Tom',)
('John',)
('Dave',)
('Spencer',)
('Bob',)
('Bill',)
('Frank',)
('Tom',)
('Thomas',)
('Mike',)
('Michael',)

In [25]:
sql6 = "SELECT Name from person ORDER BY Name ASC"

In [26]:
cursor.execute ( sql6 )

In [27]:
for el in cursor:
    print(el)

('Bill',)
('Bob',)
('Dave',)
('Frank',)
('John',)
('Michael',)
('Mike',)
('Spencer',)
('Thomas',)
('Tom',)
('Tom',)

In [28]:
sql7 = "SELECT Name, LastName from person ORDER BY LastName ASC"

In [29]:
cursor.execute ( sql7 )

In [30]:
for el in cursor:
    print(el)

('Tom', 'Abbah')
('Frank', 'Korg')
('Spencer', 'Lemmy')
('Thomas', 'Linton')
('John', 'Loves')
('Dave', 'Obi')
('Tom', 'Powell')
('Bill', 'Rommer')
('Mike', 'Semid')
('Bob', 'Stone')
('Michael', 'Vard')

In [31]:
## let's add a few columns to our table

In [32]:
sql8 = "ALTER TABLE person ADD COLUMN id INT AUTO_INCREMENT PRIMARY KEY"

In [33]:
cursor.execute ( sql8 )

In [34]:
sql9 = "SELECT * from person"

In [35]:
cursor.execute ( sql9 )

In [36]:
for element in cursor:
    print(element)

('Tom', 'Powell', 1)
('John', 'Loves', 2)
('Dave', 'Obi', 3)
('Spencer', 'Lemmy', 4)
('Bob', 'Stone', 5)
('Bill', 'Rommer', 6)
('Frank', 'Korg', 7)
('Tom', 'Abbah', 8)
('Thomas', 'Linton', 9)
('Mike', 'Semid', 10)
('Michael', 'Vard', 11)

In [37]:
cursor.execute ( "DESC person" )
for el in cursor:
    print(el)

('Name', b'char(22)', 'YES', b'', None, b'')
('LastName', b'varchar(22)', 'YES', b'', None, b'')
('id', b'int(11)', 'NO', b'PRI', None, b'auto_increment')

In [38]:
## so now we have id (Primary Key)
## you have learned a few thing so far
## First of all how to create a databse, how to creat a table, how to add coulmns, how to add values
## Good for you!
## So now let's make some examples of different Query clauses:
## Just a reminder:
## SELECT - which column to include
## FROM - which table and how the tables should be joined
## WHERE - filters unwanted data
## GROUP BY - group rows together by common column values
## HAVING - filters unwanted groups
## ORDER BY - sorts

In [39]:
sql9 = "SELECT Name, LastName,id from person WHERE id = 7"

In [40]:
cursor.execute ( sql9 )

In [41]:
for element in cursor:
    print(element)

('Frank', 'Korg', 7)

In [42]:
sql10 = "SELECT Name, LastName,id from person WHERE Name = 'Tom' ORDER BY LastName ASC"

In [43]:
cursor.execute ( sql10 )

In [44]:
for element in cursor:
    print(element)

('Tom', 'Abbah', 8)
('Tom', 'Powell', 1)

In [45]:
## let's add countr

In [46]:
sql11 = "ALTER TABLE person ADD COLUMN country VARCHAR(30)"

In [47]:
cursor.execute ( sql11 )

In [48]:
sql12 = "SELECT * FROM person"

In [49]:
cursor.execute ( sql12 )

In [50]:
for element in cursor:
    print(element)

('Tom', 'Powell', 1, None)
('John', 'Loves', 2, None)
('Dave', 'Obi', 3, None)
('Spencer', 'Lemmy', 4, None)
('Bob', 'Stone', 5, None)
('Bill', 'Rommer', 6, None)
('Frank', 'Korg', 7, None)
('Tom', 'Abbah', 8, None)
('Thomas', 'Linton', 9, None)
('Mike', 'Semid', 10, None)
('Michael', 'Vard', 11, None)

In [51]:
## let's now update data
## let's say we want first 5 people to be from Germany
## and last 6 people from Italy

In [52]:
i = 1
for element in name:
    if i <= 5:
        sql = "UPDATE person SET country = 'Germany' WHERE id = %s" %(i)
    else:
        sql = "UPDATE person SET country = 'Italy' WHERE id = %s" %(i)
    cursor.execute ( sql )
    i += 1

In [53]:
## let's add age

In [54]:
sql13 = "ALTER TABLE person ADD COLUMN age Int"

In [55]:
cursor.execute ( sql13 )

In [56]:
i = 1
for element in name:
    # random number (int between 1 and 100)
    import random
    age = random.randint(1,101)
    sql = "UPDATE person SET age = %s WHERE id = %s" %(age, i)
    cursor.execute ( sql )
    i += 1

In [57]:
sql14 = "SELECT * FROM person"

In [58]:
cursor.execute ( sql14 )

In [59]:
for element in cursor:
    print(element)

('Tom', 'Powell', 1, 'Germany', 28)
('John', 'Loves', 2, 'Germany', 95)
('Dave', 'Obi', 3, 'Germany', 23)
('Spencer', 'Lemmy', 4, 'Germany', 12)
('Bob', 'Stone', 5, 'Germany', 48)
('Bill', 'Rommer', 6, 'Italy', 25)
('Frank', 'Korg', 7, 'Italy', 48)
('Tom', 'Abbah', 8, 'Italy', 50)
('Thomas', 'Linton', 9, 'Italy', 60)
('Mike', 'Semid', 10, 'Italy', 51)
('Michael', 'Vard', 11, 'Italy', 42)

In [60]:
## so now we can use GROUP BY

In [61]:
sql15 = "SELECT COUNT(*) as total, country FROM person WHERE age >= 40 GROUP BY country "

In [62]:
cursor.execute ( sql15 )

In [63]:
for element in cursor:
    print(element)

(2, 'Germany')
(5, 'Italy')

In [64]:
## we have 3 people older than 40 in Germany and 3 people older than 40 in Italy

In [65]:
## Can you figure out an example with HAVING ? Good luck!